#ifndef __KERNEL_DEFINES_H
#define __KERNEL_DEFINES_H

#pragma comment(lib, "kernelext")

#include "keFileInfo.h"
#include "keXexInfo.h"
#include "kePrivateStructs.h"
#include "keDriver.h"
#include "keXeCrypt.h"
#include "keXeKeys.h"
#include "keXConfig.h"
#include "keSmc.h"
#include "keNand.h"
#include "kernelExpEnum.h"

#define OBJ_SYS_STRING	"\\System??\\%s"
#define OBJ_USR_STRING	"\\??\\%s"
#define OBJ_SYS_PATH	"\\System??\\"
#define OBJ_USR_PATH	"\\??\\"

// common modules
#define MODULE_KERNEL	"xboxkrnl.exe"
#define MODULE_XAM		"xam.xex"
#define MODULE_SIGNIN	"signin.xex"
#define MODULE_HUD		"hud.xex"
#define MODULE_XBDM		"xbdm.xex"

// some handy intrinsics and macros that are left out...
#define __isync()		__emit(0x4C00012C)

#define doSync(addr) \
	do { \
	__dcbst(0, addr); \
	__sync(); \
	__isync(); \
	} while (0)

#define doLightSync(addr) \
	do { \
	__dcbst(0, addr); \
	__sync(); \
	} while (0)

// debug serial port register
#define DBG_SERIAL_RCV		(DWORD volatile*)0x7FEA1010
#define DBG_SERIAL_XMIT		(DWORD volatile*)0x7FEA1014
#define DBG_SERIAL_STS		(DWORD volatile*)0x7FEA1018
#define DBG_SERIAL_CNTRL	(DWORD volatile*)0x7FEA101C

#define FILE_DIRECTORY_FILE                     0x00000001
#define FILE_WRITE_THROUGH                      0x00000002
#define FILE_SEQUENTIAL_ONLY                    0x00000004
#define FILE_NO_INTERMEDIATE_BUFFERING          0x00000008

#define FILE_SYNCHRONOUS_IO_ALERT               0x00000010

#define XEX_LOADIMG_FLAG_PATCH           0x00000010
#define XEX_LOADIMG_FLAG_PATCH_FULL      0x00000020
#define XEX_LOADIMG_FLAG_PATCH_DELTA     0x00000040
#define XEX_LOADIMG_FLAG_BOUND_PATH      0x40000000
#define XEX_LOADIMG_FLAG_SILENT_LOAD     0x80000000
#define XEX_LOADIMG_TYPE_TITLE 			(XEX_LOADIMG_FLAG_TITLE_PROCESS)
#define XEX_LOADIMG_TYPE_TITLE_DLL 		(XEX_LOADIMG_FLAG_TITLE_PROCESS | XEX_LOADIMG_FLAG_DLL)
#define XEX_LOADIMG_TYPE_SYSTEM_APP 	(XEX_LOADIMG_FLAG_DLL)
#define XEX_LOADIMG_TYPE_SYSTEM_DLL 	(XEX_LOADIMG_FLAG_DLL | XEX_LOADIMG_FLAG_TITLE_IMPORTS)

// flags used by ExCreateThread
#define EX_CREATE_FLAG_SUSPENDED		0x00000001 // thread created suspended
#define EX_CREATE_FLAG_SYSTEM			0x00000002 // create a system thread
#define EX_CREATE_FLAG_TLS_STATIC		0x00000008 // allocates more object memory, KPROCESS.SizeOfTlsSlots+KPROCESS.SizeOfTlsStaticData
#define EX_CREATE_FLAG_PRIORITY1		0x00000020 // sets priority class for the thread to 1 via KeSetPriorityClassThread - foreground
#define EX_CREATE_FLAG_PRIORITY0		0x00000040 // sets priority class for the thread to 0 via KeSetPriorityClassThread - background
#define EX_CREATE_FLAG_RETURN_KTHREAD	0x00000080 // puts PKTHREAD into pHandle instead of the thread HANDLE
#define EX_CREATE_FLAG_TITLE_EXEC		0x00000100 // title execution thread
#define EX_CREATE_FLAG_HIDDEN			0x00000400 // hides the thread from debugger thread list
// { more in here in regards to thread scheduler }
#define EX_CREATE_FLAG_CORE0			0x01000000 // threads starts on 1st cpu core
#define EX_CREATE_FLAG_CORE1			0x02000000 // threads starts on 2nd cpu core
#define EX_CREATE_FLAG_CORE2			0x04000000 // threads starts on 3rd cpu core
#define EX_CREATE_FLAG_CORE3			0x08000000 // threads starts on 4th cpu core
#define EX_CREATE_FLAG_CORE4			0x10000000 // threads starts on 5th cpu core
#define EX_CREATE_FLAG_CORE5			0x20000000 // threads starts on 6th cpu core

// Can be used instead of module name to get module address where XexGetModuleHandle() is called
#define GET_MODULE_HANDLE_EX_FLAG_FROM_ADDRESS	(PSZ)(-1)

typedef enum _POOL_TYPE {
	PoolTypeThread = 0x0,
	PoolTypeTitle = 0x1,
	PoolTypeSystem = 0x2,
	PoolTypeTitleDebug = 0x3,
	PoolTypeSystemDebug = 0x4,
} POOL_TYPE;

typedef enum { // effects on jtag noted in comment
	HalHaltRoutine = 0x0, // hard poweroff (used by hotplug HDD) HalpPowerDownSystemNow
	HalRebootRoutine = 0x1, // hard reset (video error) HalpRebootSystem
	HalKdRebootRoutine = 0x2, // hard reset (used for dumpwritedump/frozen processor) HalpRebootSystem
	HalFatalErrorRebootRoutine = 0x3, // hard reset HalpRebootSystem
	HalResetSMCRoutine = 0x4, // power off (hard) HalpRebootSystem
	HalPowerDownRoutine = 0x5, // power off (nice) HalpPowerDownSystem
	HalRebootQuiesceRoutine = 0x6, // E79 (lost settings) HalpRebootQuiesceSystem
	HalForceShutdownRoutine = 0x7, // frozen console HalpRequestPowerDownDpc
	HalPowerCycleQuiesceRoutine = 0x8,
	HalMaximumRoutine = 0x9,
} FIRMWARE_REENTRY;

/* description about xex exe headers in memory */
typedef struct _XBOX_HARDWARE_INFO {
	DWORD Flags;
	unsigned char NumberOfProcessors;
	unsigned char PCIBridgeRevisionID;
	unsigned char Reserved[6];
	unsigned short BldrMagic;
	unsigned short BldrFlags;
} XBOX_HARDWARE_INFO, *PXBOX_HARDWARE_INFO;

typedef struct _EX_TITLE_TERMINATE_REGISTRATION
{
	void* NotificationRoutine; // function pointer
	u32 Priority; // xam uses 0x7C800000 for early and 0x0 for late
	LIST_ENTRY ListEntry; // already defined in winnt.h
} EX_TITLE_TERMINATE_REGISTRATION, *PEX_TITLE_TERMINATE_REGISTRATION;

typedef struct _EX_THREAD_REGISTRATION {
	void* NotificationRoutine;
	DWORD Priority;
	LIST_ENTRY ListEntry;
} EX_THREAD_REGISTRATION, *PEX_THREAD_REGISTRATION;

typedef struct _VD_NOTIFICATION_REGISTRATION {
	PVOID NotificationRoutine; // 0x0 sz:0x4 void(*)()
	long Priority; // 0x4 sz:0x4
	LIST_ENTRY ListEntry; // 0x8 sz:0x8
} VD_NOTIFICATION_REGISTRATION, *PVD_NOTIFICATION_REGISTRATION; // size 16
C_ASSERT(sizeof(VD_NOTIFICATION_REGISTRATION) == 0x10);

typedef void (*pfnThreadNotificationRoutine)(PEX_THREAD_REGISTRATION ThisRegistration, PKTHREAD Thread, BOOL Creating);
typedef int (*LP_VD_NOTIFICATION_CALLBACK)(const PVD_NOTIFICATION_REGISTRATION vdReg, DWORD type, void * buf);

typedef struct _XBOX_KRNL_VERSION{
	WORD Major; // for 360 this is always 2
	WORD Minor; // usually 0
	WORD Build; // current version, for example 9199
	WORD Qfe;
} XBOX_KRNL_VERSION, *PXBOX_KRNL_VERSION;

typedef struct _KTIME_STAMP_BUNDLE {
	LARGE_INTEGER InterruptTime; // 0
	LARGE_INTEGER SystemTime; // 8
	DWORD TickCount; // 10
} KTIME_STAMP_BUNDLE, *PKTIME_STAMP_BUNDLE;

typedef struct _LZX_DECOMPRESS {
	LONG WindowSize;
	LONG CpuType;
} LZX_DECOMPRESS, *PLZX_DECOMPRESS;

typedef struct _TIME_FIELDS { 
	SHORT Year; // 0x0 sz:0x2
	SHORT Month; // 0x2 sz:0x2
	SHORT Day; // 0x4 sz:0x2
	SHORT Hour; // 0x6 sz:0x2
	SHORT Minute; // 0x8 sz:0x2
	SHORT Second; // 0xA sz:0x2
	SHORT Milliseconds; // 0xC sz:0x2
	SHORT Weekday; // 0xE sz:0x2
} TIME_FIELDS, *PTIME_FIELDS; // size 16
C_ASSERT(sizeof(TIME_FIELDS) == 0x10);

#ifdef __cplusplus
extern "C" {
#endif

	NTSYSAPI
	EXPORTNUM(3)
	VOID
	NTAPI
	DbgPrint(
		IN		const char* s,
		...
	);

	NTSYSAPI
	EXPORTNUM(7)
	VOID
	NTAPI
	ExAcquireReadWriteLockExclusive(
		IN OUT	PERWLOCK pExReadWriteLock
	);

	// http://msdn.microsoft.com/en-us/library/ff544520%28v=vs.85%29.aspx
	// pool functions return NULL if there is insufficient memory
	// uses POOL_TYPE NonPagedPool
	// uses tag 'enoN' (None)
	NTSYSAPI
	EXPORTNUM(9)
	PVOID
	NTAPI
	ExAllocatePool(
		IN  	DWORD NumberOfBytes
	);

	// uses POOL_TYPE NonPagedPool
	NTSYSAPI
	EXPORTNUM(10)
	PVOID
	NTAPI
	ExAllocatePoolWithTag(
		IN  DWORD NumberOfBytes,
		IN  DWORD Tag
	);

	NTSYSAPI
	EXPORTNUM(11)
	PVOID
	NTAPI
	ExAllocatePoolTypeWithTag(
		IN  DWORD NumberOfBytes,
		IN  DWORD Tag,
		IN  POOL_TYPE PoolType
	);

	EXPORTNUM(12)
	extern PDWORD ExConsoleGameRegion;

	NTSYSAPI
	EXPORTNUM(13)
	DWORD
	NTAPI
