#ifndef __XAMEXT_DEFINES_H
#define __XAMEXT_DEFINES_H

#pragma comment(lib, "xamext")
#pragma comment(lib, "xav")

#include "xamXContent.h"
#include "xamTask.h"
#include "xamNet.h"
#include "xamExpEnum.h"

typedef PVOID                           HXAMAPP, *PHXAMAPP;

typedef enum
{
	XHUDOPENSTATE_NONE = 0x0,
	XHUDOPENSTATE_HALF = 0x1,
	XHUDOPENSTATE_FULL = 0x2,
	XHUDOPENSTATE_ERROR = 0x3,
	XHUDOPENSTATE_NUI_FULL = 0x4,
	XHUDOPENSTATE_NUI_ERROR = 0x5,
	XHUDOPENSTATE_COUNT = 0x6,
} XHUDOPENSTATE, *PXHUDOPENSTATE;

typedef enum {
	XNOTIFYUI_TYPE_FRIENDONLINE = 0,
	XNOTIFYUI_TYPE_GAMEINVITE = 1,
	XNOTIFYUI_TYPE_FRIENDREQUEST = 2,
	XNOTIFYUI_TYPE_GENERIC = 3, // mail icon
	XNOTIFYUI_TYPE_MULTIPENDING = 4,
	XNOTIFYUI_TYPE_PERSONALMESSAGE = 5,
	XNOTIFYUI_TYPE_SIGNEDOUT = 6,
	XNOTIFYUI_TYPE_SIGNEDIN = 7,
	XNOTIFYUI_TYPE_SIGNEDINLIVE = 8,
	XNOTIFYUI_TYPE_SIGNEDINNEEDPASS = 9,
	XNOTIFYUI_TYPE_CHATREQUEST = 10,
	XNOTIFYUI_TYPE_CONNECTIONLOST = 11,
	XNOTIFYUI_TYPE_DOWNLOADCOMPLETE = 12,
	XNOTIFYUI_TYPE_SONGPLAYING = 13, // music icon
	XNOTIFYUI_TYPE_PREFERRED_REVIEW = 14, // happy face icon
	XNOTIFYUI_TYPE_AVOID_REVIEW = 15, // sad face icon
	XNOTIFYUI_TYPE_COMPLAINT = 16, // hammer icon
	XNOTIFYUI_TYPE_CHATCALLBACK = 17,
	XNOTIFYUI_TYPE_REMOVEDMU = 18,
	XNOTIFYUI_TYPE_REMOVEDGAMEPAD = 19,
	XNOTIFYUI_TYPE_CHATJOIN = 20,
	XNOTIFYUI_TYPE_CHATLEAVE = 21,
	XNOTIFYUI_TYPE_GAMEINVITESENT = 22,
	XNOTIFYUI_TYPE_CANCELPERSISTENT = 23,
	XNOTIFYUI_TYPE_CHATCALLBACKSENT = 24,

	DVD_MEDIA_TYPE_GAME_MOVIE_HYBRID	= 0x09,
	DVD_MEDIA_TYPE_DVD_HD				= 0x0A,
} DVD_MEDIA_TYPES;

typedef enum _DVD_TRAY_STATE {
	DVD_TRAY_STATE_EMPTY = 0,
	DVD_TRAY_STATE_CLOSING = 1,
	DVD_TRAY_STATE_OPEN = 2,
	DVD_TRAY_STATE_OPENING = 3,
	DVD_TRAY_STATE_CLOSED = 4,
	DVD_TRAY_STATE_ERROR = 5
} DVD_TRAY_STATE;

typedef enum _STAGING_MODE {
	STAGING_MODE_PRODUCTION = 0x0,
	STAGING_MODE_STAGING = 0x1,
} STAGING_MODE;

// for use with XamDbgSetOutputLevel and XamDbgSetBreakLevel
typedef enum _XDEBUG_LEVEL {
	XDEBUG_ERROR = 1, // ERR
	XDEBUG_WARN, // WRN
	XDEBUG_TRACE, // TRC
	XDEBUG_ENT, // ENT
	XDEBUG_EXT, // EXT
} XDEBUG_LEVEL;

typedef enum _XAM_CACHE_FILE_TYPE {
	XAM_CACHE_ALL = 0x0,
	XAM_CACHE_GAME_TILE = 0x1,				// 'TT'
	XAM_CACHE_ACHIEVEMENT_TILE = 0x2,		// 'AT'
	XAM_CACHE_GAMER_TILE = 0x3,				// 'GT'
	XAM_CACHE_GAMER_TILE_SMALL = 0x4,		// ''
	XAM_CACHE_CUSTOM_GAMER_TILE = 0x5,		// 'CT'
	XAM_CACHE_CUSTOM_GAMER_TILE_SMALL = 0x6,// ''
	XAM_CACHE_FRIEND_MUTE_LIST = 0x7,		// 'FM'
	XAM_CACHE_TICKETS = 0x8,				// 'TK'
	XAM_CACHE_TITLE_NAMES = 0x9,			// 'TN'
	XAM_CACHE_RECENT_PLAYERS = 0xA,			// ''
	XAM_CACHE_TITLE_UPDATE = 0xB,			// 'TU'
	XAM_CACHE_SYSTEM_UPDATE = 0xC,			// 'SU'
	XAM_CACHE_DASHBOARD_APP = 0xD,			// 'DA'
	XAM_CACHE_SPA_FILE = 0xE,				// 'SP'
	XAM_CACHE_GAME_INVITE = 0xF,			// 'GI'
	XAM_CACHE_GAMER_TAG = 0x10,				// 'GA'
	XAM_CACHE_MESSENGER_BUDDIES = 0x11,		// 'MB'
	XAM_CACHE_QOS_HISTORY = 0x12,			// 'QH'
	XAM_CACHE_PROFILE_SETTINGS = 0x13,		// 'PS'
	XAM_CACHE_AVATAR_GAMER_TILE = 0x14,		// 'AV'
	XAM_CACHE_CERT_STORAGE = 0x15,			// 'CA'
	XAM_CACHE_VALIDATE_CERT = 0x16,			// 'VC'
	XAM_CACHE_NUI_SESSION = 0x17,			// 'NS'
	XAM_CACHE_NUI_BIOMETRIC = 0x18,			// 'NB'
	XAM_CACHE_NUI_TROUBLESHOOTER = 0x19,	// 'TS'
	XAM_CACHE_NUI_HIVE_SETTING = 0x1A,		// 'NH'
	XAM_CACHE_XLFS_UPLOADER = 0x1B,			// 'XL'
	XAM_CACHE_DASH_CACHESEEDFILE = 0x1C,	// 'DC'
	XAM_CACHE_ZEST_AUTHENTICATION = 0x1D,	// 'ZA'
	XAM_CACHE_XSTS_TOKEN = 0x1E,			// 'XT'
	XAM_CACHE_LIVEID_DEVICE = 0x1F,			// 'LD'
	XAM_CACHE_CURRENCY_FORMATTING = 0x20,	// 'CF'
} XAM_CACHE_FILE_TYPE;

typedef VOID (CALLBACK *PFNMSGBOXRETURN)(
	IN      INT                         iButtonPressed,
	OUT     PXHUDOPENSTATE              pHudRestoreState
	);

typedef struct _XUIBRUSH*	HXUIBRUSH;

typedef DWORD (*MBOXRESULT)(DWORD r3);

//#define XSSUI_FLAGS_LOCALSIGNINONLY                 0x00000001
//#define XSSUI_FLAGS_SHOWONLYONLINEENABLED           0x00000002
//#define XSSUI_FLAGS_ALLOW_SIGNOUT                   0x00000004
#define XSSUI_FLAGS_NUI			0x00000008
//#define XSSUI_FLAGS_DISALLOW_PLAYAS                 0x00000010
//#define XSSUI_FLAGS_ADDUSER                         0x00010000
//#define XSSUI_FLAGS_ENABLE_GUEST                    0x00080000
//#define XSSUI_FLAGS_CONVERTOFFLINETOGUEST           0x00400000
//#define XSSUI_FLAGS_DISALLOW_GUEST                  0x01000000
//													0x24030000
//													0x20000000
//													0x04000000
//													0x00020000
//													0x00010000 XSSUI_FLAGS_ADDUSER

typedef struct _XSHOWSIGNINUI_PARAMS { 
	DWORD dwTrackingID; // 0x0 sz:0x4
	DWORD dwUserIndex; // 0x4 sz:0x4
	DWORD cPanes; // 0x8 sz:0x4
	DWORD dwFlags; // 0xC sz:0x4
	PXOVERLAPPED pOverlapped; // 0x10 sz:0x4
} XSHOWSIGNINUI_PARAMS, *PXSHOWSIGNINUI_PARAMS; // size 20
C_ASSERT(sizeof(XSHOWSIGNINUI_PARAMS) == 0x14);

typedef struct _MESSAGEBOX_PARAMS { 
	DWORD dwTrackingID; // 0x0 sz:0x4
	DWORD dwUserIndex; // 0x4 sz:0x4
	DWORD eHudType; // 0x8 sz:0x4 enum HUDSCENE
	wchar_t szTitle[0x2B]; // 0xC sz:0x56
	wchar_t szText[0x180]; // 0x62 sz:0x300
	// 2 bytes align when packed
	DWORD cButtons; // 0x364 sz:0x4
	wchar_t rgButtons[3][0x2B]; // 0x368 sz:0x102
	// 2 bytes align when packed
	DWORD dwFocusButton; // 0x46C sz:0x4
	DWORD dwFlags; // 0x470 sz:0x4
	PMESSAGEBOX_RESULT pResult; // 0x474 sz:0x4
	PXOVERLAPPED pOverlapped; // 0x478 sz:0x4
} MESSAGEBOX_PARAMS, *PMESSAGEBOX_PARAMS; // size 1148
C_ASSERT(sizeof(MESSAGEBOX_PARAMS) == 0x47C);

typedef struct _XINPUT_DEVICE_STATS {
	DWORD BatteryLevel; // 0x0 sz:0x4
	DWORD BatteryType; // 0x4 sz:0x4
	DWORD SignalStrength; // 0x8 sz:0x4
	DWORD DeviceType; // 0xC sz:0x4
	DWORD DevicePort; // 0x10 sz:0x4
	DWORD DeviceVersion; // 0x14 sz:0x4
	int Jumped; // 0x18 sz:0x4
} XINPUT_DEVICE_STATS, *PXINPUT_DEVICE_STATS; // size 28
C_ASSERT(sizeof(XINPUT_DEVICE_STATS) == 0x1C);

typedef struct _XINPUT_CAPABILITIES_EX { 
	BYTE Type; // 0x0 sz:0x1
	BYTE SubType; // 0x1 sz:0x1
	WORD Flags; // 0x2 sz:0x2
	XINPUT_GAMEPAD Gamepad; // 0x4 sz:0xC
	XINPUT_VIBRATION Vibration; // 0x10 sz:0x4
	WORD Vid; // 0x14 sz:0x2
	WORD Pid; // 0x16 sz:0x2
	WORD Revision; // 0x18 sz:0x2
	BYTE OriginalSubType; // 0x1A sz:0x1
	BYTE ExtraFlags; // 0x1B sz:0x1
	DWORD Xid; // 0x1C sz:0x4
} XINPUT_CAPABILITIES_EX, *PXINPUT_CAPABILITIES_EX; // size 32
C_ASSERT(sizeof(XINPUT_CAPABILITIES_EX) == 0x20);

// see xinputdefs.h in sdk for others
// #define XINPUT_FLAG_ANYUSER		0x40000000
#define XINPUT_FLAG_SYSTEMAPP	0x80000000

// XamUserGetDeviceContext categories
#define DRV_CATEGORY_INPUT		0x0
#define DRV_CATEGORY_OUTPUT		0x1

typedef enum {
	XDASHLAUNCHDATA_COMMAND_DEFAULT = 0, // 14719
	XDASHLAUNCHDATA_COMMAND_SIGNUP = 1,
	XDASHLAUNCHDATA_COMMAND_NETWORKTROUBLESHOOTER = 2,
	XDASHLAUNCHDATA_COMMAND_ARCADE = 3,
	XDASHLAUNCHDATA_COMMAND_MEMORY = 4,
	//XDASHLAUNCHDATA_COMMAND_ = 5,
	XDASHLAUNCHDATA_COMMAND_MUSICPLAYER = 6, // 14719
	XDASHLAUNCHDATA_COMMAND_PLAYDVD = 7, // 14719
	XDASHLAUNCHDATA_COMMAND_MEDIA_CENTER = 8, // 14719
	XDASHLAUNCHDATA_COMMAND_MEDIANETWORKTROUBLESHOOTER = 9,
	XDASHLAUNCHDATA_COMMAND_ACCOUNTMANAGE_HOME = 10,
	XDASHLAUNCHDATA_COMMAND_ACCOUNTMANAGE_PRIVACY = 11,
	XDASHLAUNCHDATA_COMMAND_ACCOUNTMANAGE_ACCEPTTOU = 12,
	XDASHLAUNCHDATA_COMMAND_ACCOUNTMANAGE_BILLING = 13,
	XDASHLAUNCHDATA_COMMAND_GAMES_DEMOS = 14,
	XDASHLAUNCHDATA_COMMAND_GAMES_TRAILERS = 15,
	XDASHLAUNCHDATA_COMMAND_RETURNFROMENTRYPOINT_MUSIC = 16,
	XDASHLAUNCHDATA_COMMAND_MARKETPLACE_TILES = 17,
	XDASHLAUNCHDATA_COMMAND_SETTINGS = 18,
	XDASHLAUNCHDATA_COMMAND_RETURNFROMENTRYPOINT_GAMES = 19,
	XDASHLAUNCHDATA_COMMAND_FAMILY_SETTINGS = 20, // 14719
	XDASHLAUNCHDATA_COMMAND_RETURNFROMENTRYPOINT_SYSTEM = 21,
	XDASHLAUNCHDATA_COMMAND_OOBE_WELCOME = 22,
	XDASHLAUNCHDATA_COMMAND_GAMES_ARCADE = 23,
	//XDASHLAUNCHDATA_COMMAND_ = , // 24-38
	XDASHLAUNCHDATA_COMMAND_VIDEOPLAYER = 39, // 14719
	XDASHLAUNCHDATA_COMMAND_PICTURE_VIEWER = 44, // 14719
	XDASHLAUNCHDATA_COMMAND_SYSTEM_SETTINGS = 47, // 14719
} XDASHLAUNCHDATA_COMMAND;

typedef struct _XDASHLAUNCHDATA { 
	DWORD dwVersion; // 0x0 sz:0x4
	DWORD dwCommand; // 0x4 sz:0x4
	DWORD dwUserIndex; // 0x8 sz:0x4
	BYTE Reserved[0x3F0]; // 0xC sz:0x3F0
} XDASHLAUNCHDATA, *PXDASHLAUNCHDATA; // size 1020
C_ASSERT(sizeof(XDASHLAUNCHDATA) == 0x3FC);

typedef struct _FU_LAUNCH_DATA { 
	DWORD Source; // 0x0 sz:0x4
	DWORD Reason; // 0x4 sz:0x4
	DWORD LiveEnabled; // 0x8 sz:0x4
	BYTE Padding[0x1F0]; // 0xC sz:0x1F0
	char XBE[0x200]; // 0x1FC sz:0x200
} FU_LAUNCH_DATA, *PFU_LAUNCH_DATA; // size 1020
C_ASSERT(sizeof(FU_LAUNCH_DATA) == 0x3FC);

typedef struct _XLAUNCHDATA_EPIX { 
	DWORD dwID; // 0x0 sz:0x4
	DWORD dwUserIndex; // 0x4 sz:0x4
	DWORD dwFlags; // 0x8 sz:0x4
	wchar_t Param[0x80]; // 0xC sz:0x100
} XLAUNCHDATA_EPIX, *PXLAUNCHDATA_EPIX; // size 268
C_ASSERT(sizeof(XLAUNCHDATA_EPIX) == 0x10C);

typedef struct _XLAUNCHDATA_CAFEBABE { 
	DWORD dwID; // 0x0 sz:0x4 << 0xCAFEBABE
	BYTE Param[0x2C]; // 0x4 sz:0x
	DWORD deviceId; // 0x30 sz:0x4
} XLAUNCHDATA_CAFEBABE, *PXLAUNCHDATA_CAFEBABE; // size 52
C_ASSERT(sizeof(XLAUNCHDATA_CAFEBABE) == 0x34);

// from Xna_TitleLauncher.xex
typedef struct _XLAUNCHDATA_CAFEBABE2 { 
	XLAUNCHDATA_CAFEBABE param; // 0x0
	DWORD unused; // 0x34
	QWORD qwUnk; // 0x38
	BYTE bParm[0x134]; // 0x40
	DWORD dwUnk; // 0x174
} XLAUNCHDATA_CAFEBABE2, *PXLAUNCHDATA_CAFEBABE2; // size 376
C_ASSERT(sizeof(XLAUNCHDATA_CAFEBABE2) == 0x178);

// from Xna_TitleLauncher.xex
typedef struct _XLAUNCHDATA_CAFEBABE3 { 
	XLAUNCHDATA_CAFEBABE param; // 0x0
	DWORD unused; // 0x34
	BYTE bParm[0x200]; // 0x38
} XLAUNCHDATA_CAFEBABE3, *PXLAUNCHDATA_CAFEBABE3; // size 568
C_ASSERT(sizeof(XLAUNCHDATA_CAFEBABE3) == 0x238);

typedef struct _XDASHLAUNCHDATA_XAMUIAPP { 
	DWORD dwID; // 0x0 sz:0x4
	BYTE Reserved[0x3EC]; // 0x4 sz:0x3EC
} XDASHLAUNCHDATA_XAMUIAPP, *PXDASHLAUNCHDATA_XAMUIAPP; // size 1008
C_ASSERT(sizeof(XDASHLAUNCHDATA_XAMUIAPP) == 0x3F0);

typedef struct _XLAUNCHDATA_DASHAPP { 
	char AppName[0x40]; // 0x0 sz:0x40
	DWORD AppParamsSize; // 0x40 sz:0x4
	BYTE AppParams[0x200]; // 0x44 sz:0x200
} XLAUNCHDATA_DASHAPP, *PXLAUNCHDATA_DASHAPP; // size 580
C_ASSERT(sizeof(XLAUNCHDATA_DASHAPP) == 0x244);

typedef struct _XAVATAR_AWARDS_COUNTER { 
	BYTE bEarned; // 0x0 sz:0x1
	BYTE bPossible; // 0x1 sz:0x1
} XAVATAR_AWARDS_COUNTER, *PXAVATAR_AWARDS_COUNTER; // size 2
C_ASSERT(sizeof(XAVATAR_AWARDS_COUNTER) == 0x2);

typedef struct _XUSER_TITLE_PLAYED { 
	DWORD dwTitleId; // 0x0 sz:0x4
	DWORD dwAchievementsPossible; // 0x4 sz:0x4
	DWORD dwAchievementsEarned; // 0x8 sz:0x4
	DWORD dwCredPossible; // 0xC sz:0x4
	DWORD dwCredEarned; // 0x10 sz:0x4
	WORD wReservedAchievementCount; // 0x14 sz:0x2
	XAVATAR_AWARDS_COUNTER AllAvatarAwards; // 0x16 sz:0x2
	XAVATAR_AWARDS_COUNTER MaleAvatarAwards; // 0x18 sz:0x2
	XAVATAR_AWARDS_COUNTER FemaleAvatarAwards; // 0x1A sz:0x2
	DWORD dwReservedFlags; // 0x1C sz:0x4
	FILETIME ftLastLoaded; // 0x20 sz:0x8
	wchar_t wszTitleName[0x40]; // 0x28 sz:0x80
} XUSER_TITLE_PLAYED, *PXUSER_TITLE_PLAYED; // size 168
C_ASSERT(sizeof(XUSER_TITLE_PLAYED) == 0xA8);


// *********** PACKING STARTS HERE **************//
#pragma pack(push, 1)
// *********** PACKING STARTS HERE **************//
typedef struct _XAMACCOUNTINFO { 
	DWORD dwReserved; // 0x0 sz:0x4
	DWORD dwLiveFlags; // 0x4 sz:0x4
	WCHAR szGamerTag[0x10]; // 0x8 sz:0x20
	XUID xuidOnline; // 0x28 sz:0x8
	DWORD dwCachedUserFlags; // 0x30 sz:0x4
	DWORD dwOnlineServiceNetworkID; // 0x34 sz:0x4
	BYTE rgbPasscode[0x4]; // 0x38 sz:0x4
	char szOnlineDomain[0x14]; // 0x3C sz:0x14
	char szOnlineKerberosRealm[0x18]; // 0x50 sz:0x18
	BYTE rgbOnlineKey[0x10]; // 0x68 sz:0x10
	char szUserPassportMembername[0x72]; // 0x78 sz:0x72
	char rgcUserPassportPassword[0x20]; // 0xEA sz:0x20
	char szOwnerPassportMembername[0x72]; // 0x10A sz:0x72
} XAMACCOUNTINFO, *PXAMACCOUNTINFO; // size 380
C_ASSERT(sizeof(XAMACCOUNTINFO) == 0x17C);

typedef struct _PROFILEENUMRESULT { 
	XUID xuidOffline; // 0x0 sz:0x8
	XAMACCOUNTINFO xai; // 0x8 sz:0x17C
	DWORD DeviceID; // 0x184 sz:0x4
} PROFILEENUMRESULT, *PPROFILEENUMRESULT; // size 392
C_ASSERT(sizeof(PROFILEENUMRESULT) == 0x188);




// *********** PACKING ENDS HERE **************//
#pragma pack(pop)
// *********** PACKING ENDS HERE **************//


#ifdef __cplusplus
extern "C" {
#endif
	
	NTSYSAPI
	EXPORTNUM(309)
	HRESULT
	NTAPI
	XNetLogonGetMachineID(
		IN OUT	QWORD* pqwMachineID
	);

	NTSYSAPI
	EXPORTNUM(400)
	HRESULT // returns 0 on success
	NTAPI
	XamInputGetCapabilities(
		IN		DWORD dwUserIndex,
		IN		DWORD dwFlags, // see XINPUT_FLAG
		IN OUT	PXINPUT_CAPABILITIES capStruct
	);

	NTSYSAPI
	EXPORTNUM(401)
	HRESULT
	NTAPI
	XamInputGetState(
		IN		DWORD dwUserIndex,
		IN		DWORD dwDeviceContext, // || flags, games call with this set to 1 to get controller response which seems to be device type 1
		IN OUT	XINPUT_STATE* pInputState
	);
	
	NTSYSAPI
	EXPORTNUM(402)
	HRESULT // returns 0 on success
	NTAPI
	XamInputSetState(
		IN		DWORD dwUserIndex,
		IN		DWORD dwFlags,
